#2-5_case
'''
2-5 . Знаменитая цитата: найдите известное высказывание, 
которое вам понравилось . 
Выведите текст цитаты с именем автора . 
Результат должен выглядеть примерно так (включая кавычки): 
Albert Einstein once said, "A person who never made a
mistake never tried anything new." 
'''


#А теперь мы просто оставим тут комментарий который требуется по заданию 2-10
name = 'Caesar'
print('Caesar once said, "Veni, vidi, \nVici."')