# 7-1 . Прокат машин: напишите программу, которая спрашивает у пользователя, 
# какую машину он хотел бы взять напрокат . Выведите сообщение с введенными 
# данными (например, “Let me see if I can find you a Subaru”) . 
car = input("Какую машину вы бы хотели взять на прокат? ")
print("Ок! Посмотрим, сможем ли мы найти вам " + car)