#УПРАЖНЕНИЯ 
#Попробуйте написать несколько коротких программ, чтобы получить предварительное представление о списках Python . 
#Возможно, для упражнений из каждой главы стоит создать отдельную папку, чтобы избежать путаницы . 
#3-1 . 
#Имена: сохраните имена нескольких своих друзей в списке с именем names . 
#Выведите имя каждого друга, обратившись к каждому элементу списка (по одному за раз) .
names = ["Алексей", "Артур", "Настя"] 
print(names(0))
print(names(1))
print(names(2))

