'''3-4 . Список гостей: если бы вы могли пригласить кого угодно (из живых или умерших) на обед,
то кого бы вы пригласили? Создайте список, включающий минимум трех людей, 
которых вам хотелось бы пригласить на обед . 
Затем используйте этот список для вывода пригласительного сообщения каждому участнику . '''
guests = ["Лена", "Виктория", "Ирина", "Александр", "Анастасия"]
invitation = ", приглашаю тебя на обед!"
print(guests[0] + invitation)
print(guests[1] + invitation)
print(guests[2] + invitation)
print(guests[3] + invitation)
print(guests[4] + invitation)